## DataFrame 결합

In [1]:
# 행을 추가
import pandas as pd

In [5]:
df = pd.DataFrame({
    'S1' : [1,2,3,4],
    "S2" : [5,6,7,8]
})

df2 = pd.DataFrame([1,2])

### Concat() 함수
- 단순 결합 함수

In [8]:
pd.concat([df,df2], axis=0, ignore_index=True)

#pd.concat([df,df2]).reset_index(drop=True)

    S1   S2    0
0  1.0  5.0  NaN
1  2.0  6.0  NaN
2  3.0  7.0  NaN
3  4.0  8.0  NaN
4  NaN  NaN  1.0
5  NaN  NaN  2.0

In [10]:
df3 = pd.DataFrame({
    'S1' : [1,3]
})

In [11]:
pd.concat([df,df3])

   S1   S2
0   1  5.0
1   2  6.0
2   3  7.0
3   4  8.0
0   1  NaN
1   3  NaN

이건 S1으로 컬럼명이 같기 떄문에 밑에 바로 붙는다

#### merge()
- 데이터프레임을 결함하는 함수
- 특정 조건을 만족해야 열이 추가
-  on -> 조건
-  how -> 기준이 되는 데이터 프레임 선택

In [33]:
df4 = pd.DataFrame({
    "id" : [1,2,3,4,5],
    "item" : ["a","b","a","a","b"]
})

df5 = pd.DataFrame({
    "id" : [1,4,5,2,3],
    "name" : ["Kim","Lee","Park","Choi","Ha"]
})

df6 = pd.DataFrame({
    'item' : ['a','b','c'],
    'item_price' : [100,500,1000]
})

In [23]:
pd.concat([df4,df5])

   id item  name
0   1    a   NaN
1   2    b   NaN
2   3    c   NaN
3   4    d   NaN
4   5    e   NaN
0   1  NaN   Kim
1   4  NaN   Lee
2   5  NaN  Park
3   2  NaN  Choi
4   3  NaN    Ha

In [24]:
pd.merge(df4, df5, on='id', how='inner')

   id item  name
0   1    a   Kim
1   2    b  Choi
2   3    c    Ha
3   4    d   Lee
4   5    e  Park

In [25]:
pd.concat([df4, df6], axis=1)

   id item item  item_price
0   1    a    a       100.0
1   2    b    b       500.0
2   3    c    c      1000.0
3   4    d  NaN         NaN
4   5    e  NaN         NaN

In [36]:
pd.merge(df4,df6,on ='item', how='left')

   id item  item_price
0   1    a         100
1   2    b         500
2   3    a         100
3   4    a         100
4   5    b         500